Repository: 84000/translation-memory-resources
Catalog: post_input/toh94-C.bo.en.tmx
Source language: bo
Languages: en

source: བདེ་གཤེགས་ ཤིན་ཏུ་ མཐོ ར་ གཤེགས་ གྲོང་ཁྱེར་ རྟེན་པ འི་ ཚེ །_། དེ་བཞིན་ གཤེགས་པ་ ཚུལ་ཁྲིམས་ སྟབས་ དེ་ གྲོང་ཁྱེར་ དུ །_། གཤེགས་པ འི་ ཚེ་ ན་ གདན་ དག་ བཤམས་ ཏེ་ བཏིང་ ནས་ |#| ཀྱང་ །_། དང་པོ་ ཁོ་ན ར་ བྱང་ཆུབ་ ཏུ་ ནི་ སེམས་བསྐྱེད་ དོ །_།
en: $121 “The well-gone Atyuccagāmin, when a city beggar, |#| Prepared seats |#| For the thus-gone Strength of Discipline upon his entry into the city, |#| And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་ སྐར་རྒྱལ་ ད་ ནུར་ མཁན་ གྱི་ ཚེ །_། དེ་བཞིན་ གཤེགས་པ་ ཡུལ་འཁོར་ ལྷ་ [294a] དེ་ ལ །_། ཞལ་ཟས་ བཅའ་བ་ རྣམས་ ནི་ ཕུལ་ ནས་ |#| ཀྱང་ །_། དང་པོ ར་ བྱང་ཆུབ་ ཏུ་ ནི་ སེམས་བསྐྱེད་ དོ །_།
en: $122 “The well-gone Tiṣya, when a danur maker,#166 |#| Offered meals [294.a] |#| To the thus-gone God of the Land |#| And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་ རུ་ རིངས་ གཞན་ གྱི་ ཁོལ་ གྱུར་ ཚེ །_། དེ་བཞིན་ གཤེགས་པ་ གཟི་བརྗིད་ དགའ་ དེ་ |#| ལ །_། ལྷུང་བཟེད་ འཇམས་ ཀྱིས་ བཀང་ སྟེ་ |#| ཕུལ་ ནས་ |#| ཀྱང་ །_། དང་པོ ར་ བྱང་ཆུབ་ ཏུ་ ནི་ སེམས་བསྐྱེད་ དོ །_།
en: $123 “The well-gone Viṣāṇin, when a servant of others, |#| Offered an alms bowl filled with rice gruel |#| To the thus-gone Splendid Joy |#| And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་ ཡོན་ཏན་ གྲགས་པ་ བསོད་སྙོམས་ ཚེ །_། དེ་བཞིན་ གཤེགས་པ་ འོད་ཟེར་ མཐའ་ ཡས་ལ །_། གོས་ ཀྱི་ རས་མ་ སོར་ བཞི་ ཙམ་ ཕུལ་ ནས །_། |#| དང་པོ ར་ བྱང་ཆུབ་ ཏུ་ ནི་ སེམས་བསྐྱེད་ དོ །_།
en: $124 “The well-gone Guṇakīrti, during the giving of alms, |#| Offered cotton fabric the size of four finger widths |#| To the thus-gone Infinite Radiance |#| And in doing so first gave rise to the mind of awakening.

source: དེ་བཞིན་ གཤེགས་པ་ ཉི་ཟླ ས་ བདེ་གཤེགས་ སྲིད་ སྦྱིན་ དེ །_། |#| འཁོར་བཅས་ བྱེ་བ་ སུམ་ཅུ་ དག་ ལ་ གཙུག་ལག་ཁང་ །_། བཟང་པོ ར་ ལོངས་སྤྱོད་ ཕྱིར་ དང་ དཔག་ཚད་ བཅུ་པ འི་ གོས །_། གདིང་བ་ ཕུལ་ ནས་ དང་པོ ར་ བྱང་ཆུབ་ ཏུ་ ནི་ སེམས་བསྐྱེད་ དོ །_།
en: $125 “The thus-gone Candrārka |#| Offered splendid monastic residences and ten leagues of garments and carpets |#| To the well-gone Granter of Sovereignty and his retinue of three hundred million, |#| And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་ ཉི་འོད་ གཞན་ གྱི་ ཁོལ་ གྱུར་ ཚེ །_། དེ་བཞིན་ གཤེགས་པ་ ལྷུན་པོ་ ཆེ་ དེ་ |#| ལ །_། ལྕགས་ ཀྱི་ སྣོད་ དག་ དབུལ་བ་ བྱས་ ནས་ |#| ཀྱང་ །_། དང་པོ ར་ བྱང་ཆུབ་ ཏུ་ ནི་ སེམས་བསྐྱེད་ དོ །_།
en: $126 “The well-gone Sūryaprabha, when a servant of others, |#| Offered an iron vessel |#| To the thus-gone Majestic Mountain |#| And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་ སྐར་ མཁན་ ཚོང་པ འི་ བུར་ གྱུར་ ཚེ །_། དེ་བཞིན་ གཤེགས་པ་ ཕྱོགས་ གསལ་ དེ་ ལ་ ནི །_། ནོར་བུ་ རིན་ཆེན་ དཔག་ཚད་ གཅིག་ འོད་ལྡན །_། |#| ཕུལ་ ནས་ དང་པོ ར་ བྱང་ཆུབ་ ཏུ་ ནི་ སེམས་བསྐྱེད་ དོ །_།
en: $127 “The well-gone Jyotiṣka, when the son of a merchant, |#| Offered precious jewels shining their light across one league |#| To the thus-gone Clear Direction |#| And in doing so first gave rise to the mind of awakening.

source: དེ་བཞིན་ གཤེགས་པ་ སེང་ ཏོག་ དེད་དཔོན་ གྱི །_། བུར་ གྱུར་ ཚེ་ ན་ དེ་བཞིན་ གཤེགས་པ་པོ །_། བློ་གྲོས་ བཟང་ ལ་ ཕྲེང་བ་ ཕུལ་ ནས་ ཀྱང་ །_། དང་པོ ར་ བྱང་ཆུབ་ ཏུ་ ནི་ སེམས་བསྐྱེད་ དོ །_།
en: $128 “The thus-gone Siṃhaketu, when a captain’s son, |#| Offered a garland |#| To the thus-gone Excellent Intelligence |#| And in doing so first gave rise to the mind of awakening.

source: དེ་བཞིན་ གཤེགས་པ་ དུས་མཁྱེན་ རྒྱལ་པོ་ ནི །_། སྙན་དངགས་ མཁན་ ཚེ་ བདེ་གཤེགས་ ཙམ་ མཆོག་ ལ །_། ཚིགས་ སུ་ བཅད་པ འི་ དབྱངས་ ཀྱིས་ བསྟོད་ ནས་ |#| ཀྱང་ །_། དང་པོ ར་ བྱང་ཆུབ་ ཏུ་ ནི་ སེམས་བསྐྱེད་ དོ །_།
en: $129 “The thus-gone Velāmarāja, when a poet, |#| Offered verses of praise |#| To the well-gone Supreme Campaka |#| And in doing so first gave rise to the mind of awakening.

source: དེ་བཞིན་ གཤེགས་པ་ དཔལ་ གྱི་ སྙིང་པོ་ ཡིས །_། གཞན་ གྱི་ དགེ་འདུན་ བཤོས་ གསོལ་ ཡི་ རང་ ནས །_། |#| དེ་བཞིན་ གཤེགས་པ་ བཀོད་པ་ ཆེན་པོ་ ལ །_། དང་པོ ར་ བྱང་ཆུབ་ ཏུ་ ནི་ སེམས་བསྐྱེད་ དོ །_།
en: $130 “The thus-gone Śrīgarbha |#| Rejoiced when others offered a meal to the saṅgha |#| To the thus-gone Great Array |#| And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་ སྲིད་མཐའ་ གཟིགས་པ་ ཚལ་ དག་ གི །_། ལས་ བྱེད་ ཚེ་ ན་ དེ་བཞིན་ གཤེགས་པ་པོ །_། ཁྱད་པར་ སེམས་ ལ་ ཆབ་ གཙང་ ཕུལ་ ནས་ ཀྱང་ །_། དང་པོ ར་ བྱང་ཆུབ་ ཏུ་ ནི་ སེམས་བསྐྱེད་ དོ །_།
en: $131 “The well-gone Bhavāntadarśin, when a garden worker, |#| Offered pure water |#| To the thus-gone Distinguished Mind |#| And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་ གློག་འོད་ རྔོན་པ འི་ བུར་ གྱུར་ ཚེ །_། དེ་ [294b] བཞིན་ གཤེགས་པ་ དཔའ་བོ འི་ སེམས་ དེ་ ལ །_། རྩྭ་ ཡི་ སྟན་ དག་ དབུལ་བ་ བྱས་ ནས་ |#| ཀྱང་ །_། དང་པོ ར་ བྱང་ཆུབ་ ཏུ་ ནི་ སེམས་བསྐྱེད་ དོ །_།
en: $132 “The well-gone Vidyutprabha, when the son of a hunter, [294.b] |#| Made and offered straw seats |#| To the thus-gone Heroic Mind |#| And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་ སེང་གེ ས་ བྱིན་པ་ ཁྱིམ་བདག་ གི །_། བུར་ གྱུར་ ཚེ་ ན་ བདེ་གཤེགས་ པད་ སྙིང་ ལ །_། སྣ་མ འི་ མེ་ཏོག་ ཡོད་པ འི་ ས་གཞི་ ཕུལ །_། |#| དང་པོ ར་ བྱང་ཆུབ་ ཏུ་ ནི་ སེམས་བསྐྱེད་ དོ །_།
en: $133 “The well-gone Siṃhadatta,#167 when the son of a householder, |#| Offered land with sumanā flowers |#| To the well-gone Lotus Essence |#| And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་ གཞན་ གྱིས་ མི་ ཐུབ་ རྒྱལ་མཚན་ གྱིས །_། འཇིགས་ བཅས་ ལམ་ དུ་ འདྲོན་པ འི་ བསེལ་ བྱས་ ནས །_། |#| དེ་བཞིན་ གཤེགས་པ་ སྲེད་ མེད་ བུ་ དེ་ ལ །_། དང་པོ ར་ བྱང་ཆུབ་ ཏུ་ ནི་ སེམས་བསྐྱེད་ དོ །_།
en: $134 “The well-gone Aparājita­dhvaja |#| Escorted the thus-gone Nārāyaṇa |#| Along a dangerous route |#| And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་ མཆོག་དགའ་ གྲགས་པ་ བུ་རམ་ཤིང་ །_། འཚིར་ གྱུར་ ཚེ་ ན་ དེ་བཞིན་ གཤེགས་པ་པོ །_། བློ་ རྣམ་འབྱེད་ ལ་ བུ་རམ་ བཅུད་ ཁུ་ ཕུལ །_། |#| དང་པོ ར་ བྱང་ཆུབ་ ཏུ་ ནི་ སེམས་བསྐྱེད་ དོ །_།
en: $135 “The well-gone Pramodyakīrti, when the son of a sugarcane juicer, |#| Made sugarcane juice |#| For the thus-gone Discerning Mind |#| And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་ བརྩོན་འགྲུས་ བརྟན་པ་ བྲམ་ཟེ འི་ བུར །_། གྱུར་ ཚེ་ བདེ་གཤེགས་ འོད་ཟེར་ མཐའ་ ཡས་ལ །_། ཁྲུས་ རྐྱེན་ འདག་པ འི་ ཚལ་ དག་ ཕུལ་ ནས་ |#| ཀྱང་ །_། དང་པོ ར་ བྱང་ཆུབ་ ཏུ་ ནི་ སེམས་བསྐྱེད་ དོ །_།
en: $136 “The well-gone Dṛḍhavīrya, when the son of a brahmin, |#| Offered bathing soap |#| To the well-gone Infinite Radiance |#| And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་ གྲགས་ རྫོགས་ ཆང་ འཚོང་ བུར་ གྱུར་ ཚེ །_། དེ་བཞིན་ གཤེགས་པ་ སེང་གེ འི་ ང་རོ་ ལ །_། ལོ་མ འི་ སྣོད་ ནས་ཆུ་ དག་ ཕུལ་ ནས་ |#| ཀྱང་ །_། དང་པོ ར་ བྱང་ཆུབ་ ཏུ་ ནི་ སེམས་བསྐྱེད་ དོ །_།
en: $137 “The well-gone Saṃpannakīrti, when the son of an alcohol vendor, |#| Offered water in leaf vessels |#| To the thus-gone Lion’s Roar |#| And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་ བསྙེངས་བྲལ་ རྒྱལ་པོ འི་ བུར་ གྱུར་ ཚེ །_། དེ་བཞིན་ གཤེགས་པ་ རྒྱལ་པོ འི་ ང་རོ་ ལ །_། ལོ་མ འི་ སྣོད་ ནས་ བར་ ཤ འི་ མེ་ཏོག་ ཕུལ །_། |#| དང་པོ ར་ བྱང་ཆུབ་ ཏུ་ ནི་ སེམས་བསྐྱེད་ དོ །_།
en: $138 “The well-gone Vigatabhaya, when a prince, |#| Offered vārṣikī flowers in a leaf vessel |#| To the thus-gone Royal Roar |#| And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་ མཆོད་འོས་ ལྷ་ ནི་ བློན་ མཆོག་གྱུར་པ འི་ ཚེ །_། བདེ་གཤེགས་ ཡིད་འོང་ བློ་ འོད་ དག་ ལ་ དཔག་ཚད་ གཅིག _། ཁོར་ཡུག་ ཙམ་ གྱི་ སྐྱེད་མོས་ཚལ་ ཕུལ་ ཨ་ ག་ རུའི །_། བདུག་ པས་ བདུགས་ ཏེ་ དང་པོ ར་ བྱང་ཆུབ་ ཏུ་ ནི་ སེམས་བསྐྱེད་ དོ །_།
en: $139 “The well-gone Arhaddeva, when a chief minister, |#| Offered a one-league-large walled garden perfumed with agaru incense |#| To the well-gone Light of Delightful Mind |#| And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་ སྒྲོན་ ཆེན་ མི་ བཀྲེན་ གྱུར་པ འི་ ཚེ །_། དེ་བཞིན་ གཤེགས་པ་ བསོད་ནམས་ འོད་ དེ་ ལ །_། རྩྭ་ ཡི་ སྒྲོན་མ་ དག་ ནི་ ཕུལ་ ནས་ |#| ཀྱང་ །_། དང་པོ ར་ བྱང་ཆུབ་ ཏུ་ ནི་ སེམས་བསྐྱེད་ དོ །_།
en: $140 “The well-gone Mahāpradīpa, when he was destitute, |#| Offered a grass lantern |#| To the thus-gone Light of Merit |#| And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་ འཇིག་རྟེན་ འོད་ ནི་ ལྷ འི་ བུ འི་ ཚེ །_། དེ་བཞིན་ གཤེགས་པ་ ཟླ་བ འི་ འོད་ དེ་ ལ །_། མེ་ཏོག་ མན་ དཱ་ ར་བ འི་ གདུགས་ ཕུལ་ ནས །_། |#| དང་པོ ར་ བྱང་ཆུབ་ ཏུ་ ནི་ སེམས་བསྐྱེད་ དོ །_།
en: $141 “The well-gone Lokaprabha, when a divine son, |#| Offered a parasol of mandārava flowers |#| To the thus-gone Moonlight |#| And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་ སྤོས་དྲི་ ཞིམ་པ་ གྱད་ གྱུར་ ཚེ །_། དེ་བཞིན་ གཤེགས་པ་ ཡན་ལག་ མཛེས་ དེ་ [295a] ལ །_། ཁྲུས་རས་ དག་ ནི་ དབུལ་བ་ བྱས་ ནས་ ཀྱང་ །_། དང་པོ ར་ བྱང་ཆུབ་ ཏུ་ ནི་ སེམས་བསྐྱེད་ དོ །_།
en: $142 “The well-gone Surabhigandha, when an athlete, |#| Offered towels [295.a] |#| To the thus-gone Beautiful Limbs |#| And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་ ཡོན་ཏན་ མཆོག་འཛིན་ སྨན་པ འི་ ཚེ །_། དེ་བཞིན་ གཤེགས་པ་ རྙོག་པ་ མེད་ དོན་ ལ །_། བདུག་པ་ དང་ ནི་ དར་ཡུག་ ཕུལ་ ནས་ ཀྱང་ །_། དང་པོ ར་ བྱང་ཆུབ་ ཏུ་ ནི་ སེམས་བསྐྱེད་ དོ །_།
en: $143 “The well-gone Guṇāgradhārin, when a physician, |#| Offered incense and fine silk |#| To the thus-gone Unsullied Aim |#| And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་ མུན་ དད་ རྣམ་ བྲལ་ རྒྱལ་པོ་ ཡི །_། མདུན་ འདོན་ བུར་ གྱུར་ ཚེ་ ན་ དེ་བཞིན་ གཤེགས །_། |#| དགྲ་བཅོམ་ གཟི་ ལ་ མུ་ཏིག་ རྒྱན་ ཕྲེང་ ཕུལ །_། |#| དང་པོ ར་ བྱང་ཆུབ་ ཏུ་ ནི་ སེམས་བསྐྱེད་ དོ །_།
en: $144 “The well-gone Vigatatamas, when the son of a royal priest, |#| Offered a pearl garland |#| To the thus-gone Splendid Worthy One |#| And in doing so first gave rise to the mind of awakening.

source: དེ་བཞིན་ གཤེགས་པ་ སེང་གེ འི་ འགྲམ་པ་ ཡིས །_། དེ་བཞིན་ གཤེགས་པ་ དོན་གྲུབ་ བློ་ དེ་ ལ །_། འདམ་རྫབ་ དག་ ཏུ་ ཤིང་ ཟམ་ བཙུགས་ ཕུལ་ ནས །_། |#| དང་པོ ར་ བྱང་ཆུབ་ ཏུ་ ནི་ སེམས་བསྐྱེད་ དོ །_།
en: $145 “The thus-gone Siṃhahanu |#| Built a wooden bridge over a swamp |#| For the thus-gone Mind of Accomplishment |#| And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་ རིན་ཆེན་ གྲགས་པ་ སྤོས་ འཚོང་ གི །_། བུར་ གྱུར་ ཚེ་ ན་ བདེ་གཤེགས་ དབྱངས་ མངའ་ ལ །_། ཕྱེ་མ་ སྤར་གང་ དག་ ནི་ གཏོར་ ཕུལ་ ནས །_། |#| དང་པོ ར་ བྱང་ཆུབ་ ཏུ་ ནི་ སེམས་བསྐྱེད་ དོ །_།
en: $146 “The well-gone Ratnakīrti, when the son of an incense merchant, |#| Offered and sprinkled handfuls of incense powder |#| To the well-gone Master of Melodies |#| And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་ སྐྱོན་ རབ་ ཞི་བ་ རྒྱལ་བུ འི་ ཚེ །_། གསད་ བྱ་ བཙོན་ དག་ འབྲོས་ སུ་ བཏང་ ནས་ |#| ཀྱང་ །_། དེ་བཞིན་ གཤེགས་པ་ ས་མཆོག་ དེ་ ལ་ ནི །_། དང་པོ ར་ བྱང་ཆུབ་ ཏུ་ ནི་ སེམས་བསྐྱེད་ དོ །_།
en: $147 “The well-gone Praśāntadoṣa, when a prince, |#| Freed prisoners condemned to death |#| For the thus-gone Supreme Ground |#| And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་ བདུད་རྩི་ འཆང་བ་ གྲོང་དཔོན་ ཚེ །_། དེ་བཞིན་ གཤེགས་པ་ འོད་འབར་ དེ་ ལ་ ནི །_། བཻ་ དཱུརྱ་ ཡི་ གདུགས་ སྟོང་ ཕུལ་ ནས་ ཀྱང་ །_། དང་པོ ར་ བྱང་ཆུབ་ ཏུ་ ནི་ སེམས་བསྐྱེད་ དོ །_།
en: $148 “The well-gone Amṛtadhārin, when the leader of a city, |#| Offered one thousand parasols made of vaiḍūrya |#| To the thus-gone Blazing Light |#| And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་ མི་ཟླ་ ཕྲེང་རྒྱུད་ མཁན་ བུ འི་ ཚེ །_། དེ་བཞིན་ གཤེགས་པ་ ངེས་པ ར་ སེམས་ དེ་ ལ །_། ཨུད་པ་ ལ་ ཡི་ ཕྲེང་བ་ ཕུལ་ ནས་ |#| ཀྱང་ །_། དང་པོ ར་ བྱང་ཆུབ་ ཏུ་ ནི་ སེམས་བསྐྱེད་ དོ །_།
en: $149 “The well-gone Manujacandra, when the son of a garland maker, |#| Offered a garland of utpalas |#| To the thus-gone Certain Mind |#| And in doing so first gave rise to the mind of awakening.

source: དེ་བཞིན་ གཤེགས་པ་ ཤིན་ཏུ་ གཟིགས་པ་ ནི །_། འདུན་ དཔོན་ ཚེ་ ན་ དེ་བཞིན་ གཤེགས་པ་པོ །_། བདེན་པ ར་ གསུང་བ་ དེ་ ལ་ ཕྲེང་བ་ ཕུལ །_། |#| དང་པོ ར་ བྱང་ཆུབ་ ཏུ་ ནི་ སེམས་བསྐྱེད་ དོ །_།
en: $150 “The thus-gone Sudarśana, when a chief councillor,#168 |#| Offered a garland |#| To the thus-gone Truthful Speech |#| And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་ རབ་ བརྒྱན་ གྲོང་ཁྱེར་ ལ་ རྟེན་པ འི །_། བུར་ གྱུར་ ཚེ་ ན་ བདེ་གཤེགས་ མདངས་ འོད་ ཀྱི །_། གྲོང་ཁྱེར་ སྒོ་ དག་ མཛེས་པ ར་ བྱས་ ནས་ |#| ཀྱང་ །_། དང་པོ ར་ བྱང་ཆུབ་ ཏུ་ ནི་ སེམས་བསྐྱེད་ དོ །_།
en: $151 “The well-gone Pratimaṇḍita, when the son of a city beggar, |#| Decorated the city gates |#| For the well-gone Bright Light |#| And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་ ནོར་ འོད་ བརྒྱ་བྱིན་ གྱུར་པ འི་ ཚེ །_། བདེ་གཤེགས་ གཟི་བརྗིད་ མེ་ཏོག་ རྒྱས་པ་ ལ །_། དཔག་ཚད་ ཁོར་ཡུག་ མེ་ཏོག་ ཆར་ ཕབ་ ནས །_། |#| དང་པོ ར་ [295b] བྱང་ཆུབ་ ཏུ་ ནི་ སེམས་བསྐྱེད་ དོ །_།
en: $152 “The well-gone Maṇiprabha, when Śakra, |#| Let a rain of flowers fall across one league |#| For the well-gone Blooming Flower of Splendor |#| And in doing so first gave rise to the mind of awakening. [295.b]

source: དེ་བཞིན་ གཤེགས་པ་ ཆོས་ ཀྱི་ འབྱུང་གནས་ ཀྱིས །_། བདེ་གཤེགས་ གྲགས་ ཏོག་ ཤེས་རབ་ ཕ་རོལ་ ཕྱིན །_། |#| གསུང་ ཚེ་ ལེགས་ གསུངས་ ཞེས་ ནི་ ཡི་ རང་ ཕུལ །_། |#| དང་པོ ར་ བྱང་ཆུབ་ ཏུ་ ནི་ སེམས་བསྐྱེད་ དོ །_།
en: $153 “The thus-gone Dharmākara#169 |#| Called out ‘Excellent!’ |#| When the well-gone Banner of Fame was teaching the perfection of insight, |#| And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་ དོན་ ངེས་ ལྡན་པ་ ཐ་ག་པ ར །_། གྱུར་ ཚེ་ བདེ་གཤེགས་ ཡོན་ཏན་ གསལ་བ་ ལ །_། རས་ ཀྱི་ ཁ་ཚར་ དག་ ནི་ ཕུལ་ ནས་ ཀྱང་ །_། དང་པོ ར་ བྱང་ཆུབ་ ཏུ་ ནི་ སེམས་བསྐྱེད་ དོ །_།
en: $154 “The well-gone Arthaviniścita, when a weaver, |#| Offered woven tassels |#| To the well-gone Luminous Qualities |#| And in doing so first gave rise to the mind of awakening.

source: !བདེ་གཤེགས་ ཚེམས་ སྦྱིན་ བློ་ ཆེན་ བུར་ གྱུར་ ཚེ །_། དེ་བཞིན་ གཤེགས་པ་ ཆོས་ ཀྱི་ སྒྲོན་ དེ་ ལ །_། བསིལ་ཡབ་ དག་ ནི་ དབུལ་བ་ བྱས་ ནས་ |#| ཀྱང་ །_། དང་པོ ར་ བྱང་ཆུབ་ ཏུ་ ནི་ སེམས་བསྐྱེད་ དོ །_།
en: $155 “The well-gone Harṣadatta, when the son of a chief minister, |#| Offered a fan |#| To the thus-gone Dharma Lamp |#| And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་ རིན་ཆེན་ འབྱུང་གནས་ གཞུ་ མཁན་ ཚེ །_། དེ་བཞིན་ གཤེགས་པ་ གསལ་ རབ་ དཔལ་ དེ་ ལ །_། མེ་ཏོག་ སྙིམ་པ་ བཀང་ སྟེ་ གཏོར་ ནས་ ཀྱང་ །_། དང་པོ ར་ བྱང་ཆུབ་ ཏུ་ ནི་ སེམས་བསྐྱེད་ དོ །_།
en: $156 “The well-gone Ratnākara, when an arrow maker, |#| Scattered two handfuls of flowers |#| To the thus-gone Glory of Highest Clarity |#| And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་ སྐྱེ་ དབང་ མཚུངས་པ་ རྫ་མཁན་ ཚེ །_། དེ་བཞིན་ གཤེགས་པ་ ཞལ་ སྡུག་ སྡེ་ བདག་ ལ །_། སྣོད་ དག་ ཆུ་ ཡིས་ བཀང་ སྟེ་ |#| ཕུལ་ ནས་ |#| ཀྱང་ །_། དང་པོ ར་ བྱང་ཆུབ་ ཏུ་ ནི་ སེམས་བསྐྱེད་ དོ །_།
en: $157 “The well-gone Janendrakalpa, when a potter, |#| Offered vessels filled with water |#| To the thus-gone Lord of Those of Beautiful Countenance |#| And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་ སྟབས་ གཤེགས་ ཞིང་པ འི་ བུར་ གྱུར་ ཚེ །_། དེ་བཞིན་ གཤེགས་པ་ སེང་གེ འི་ སྟབས་ བཞུད་ ལ །_། ཟམ་སྟེགས་ དག་ ནི་ གཟུགས་པ་ བྱས་ ནས་ |#| ཀྱང་ །_། དང་པོ ར་ བྱང་ཆུབ་ ཏུ་ ནི་ སེམས་བསྐྱེད་ དོ །_།
en: $158 “The well-gone Vikrāntagāmin, when a farmer’s son, |#| Made bridges |#| For the thus-gone Lion Gait |#| And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་ བློ་ གནས་ ཤིང་ སྲུངས་ བུར་ གྱུར་ ཚེ །_། དེ་བཞིན་ གཤེགས་པ་ སྐྱེ་བོ འི་ མཆོད་རྟེན་ ལ །_། སེའུ་ འབྲུ་ དག་ ནི་ དབུལ་བ་ བྱས་ ནས་ |#| ཀྱང་ །_། དང་པོ ར་ བྱང་ཆུབ་ ཏུ་ ནི་ སེམས་བསྐྱེད་ དོ །_།
en: $159 “The well-gone Sthitabuddhi, when the son of a forest guard, |#| Offered pomegranates |#| To the thus-gone Stūpa for Humanity |#| And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་ གདུགས་ མཛེས་ བློན་པོ འི་ བུར་ གྱུར་ ཚེ །_། དེ་བཞིན་ གཤེགས་པ་ རྒྱ་མཚོ འི་ བློ་ དེ་ ལ །_། ཙམ་པ འི་ མེ་ཏོག་ཕྲེང་བ་ ཕུལ་ ནས་ |#| ཀྱང་ །_། དང་པོ ར་ བྱང་ཆུབ་ ཏུ་ ནི་ སེམས་བསྐྱེད་ དོ །_།
en: $160 “The well-gone Vibhrājacchattra, when the son of a minister, |#| Offered a garland of campa flowers |#| To the thus-gone Ocean Mind |#| And in doing so first gave rise to the mind of awakening.

source: དེ་བཞིན་ གཤེགས་པ་ གཙོ་བོ་ གསེར་མགར་ ཚེ །_། དེ་བཞིན་ གཤེགས་པ་ པད་མ འི་ སྙིང་པོ་ ལ །_། བདུག་ པས་ བདུགས་པ འི་ མེ་ཏོག་ གཏོར་ ནས་ ཀྱང་ །_། དང་པོ ར་ བྱང་ཆུབ་ ཏུ་ ནི་ སེམས་བསྐྱེད་ དོ །_།
en: $161 “The thus-gone Jyeṣṭha, when a goldsmith, |#| Scattered scented flowers |#| For the thus-gone Lotus Essence |#| And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་ ཤིན་ཏུ་ འཕགས་ དཔལ་ སྤོས་ འཚོང་ བུར །_། གྱུར་ ཚེ་ དེ་བཞིན་ གཤེགས་པ་ གདུགས་ སྡེ་ ཡི །_། འཆག་ས་ སྤོས་ ཆུས་ ཆག་ཆག་ བཏབ་ ནས་ |#| ཀྱང་ །_། དང་ [296a] པོ ར་ བྱང་ཆུབ་ ཏུ་ ནི་ སེམས་བསྐྱེད་ དོ །_།
en: $162 “The well-gone Abhyudgataśrī, when the son of an incense merchant, |#| Sprinkled fragrant water on a monastic walkway |#| For the thus-gone Cluster of Parasols [296.a] |#| And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་ སེང་གེ འི་ སྒྲ་ ནི་ རྔ་ མཁན་ ཚེ །_། དེ་བཞིན་ གཤེགས་པ་ སཱ་ལ འི་ རྒྱལ་པོ་ ལ །_། རྔ་བོ་ ཆེ་ དག་ བརྡུང་བ་ བྱས་ ནས་ |#| ཀྱང་ །_། དང་པོ ར་ བྱང་ཆུབ་ ཏུ་ ནི་ སེམས་བསྐྱེད་ དོ །_།
en: $163 “The well-gone Siṃhaghoṣa, when a drummer, |#| Beat great drums |#| For the thus-gone King of Sāla Trees |#| And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་ རྣམ་ རོལ་ ལྡན་པ་ དུང་འབུད་ མཁན །_། གྱུར་ ཚེ་ བདེ་གཤེགས་ ཉི་མ འི་ སྙིང་པོ་ དེ །_། |#| གྲོང་ཁྱེར་ གཤེགས་ ཚེ་ དུང་ དག་ བུས་ ནས་ ཀྱང་ །_། དང་པོ ར་ བྱང་ཆུབ་ ཏུ་ ནི་ སེམས་བསྐྱེད་ དོ །།_།།
en: $164 “The well-gone Vikrīḍitāvin, when a conch blower, |#| Blew conches when the well-gone Sun Essence |#| Entered a city |#| And in doing so first gave rise to the mind of awakening.

source: དེ་བཞིན་ གཤེགས་པ་ ཀླུ་ འོད་ ཟླ་བ འི་ ཚེ །_། དེ་བཞིན་ གཤེགས་པ་ བྱང་ཆུབ་ དགའ་ དེ་ |#| ལ །_། རྔ་བོ་ ཆེ་ དག་ བརྡུང་བ་ བྱས་ ནས་ |#| ཀྱང་ །_། དང་པོ ར་ བྱང་ཆུབ་ ཏུ་ ནི་ སེམས་བསྐྱེད་ དོ །_།
en: $165 “The thus-gone Nāgaprabhāsa, when he was Candra, |#| Beat great drums |#| For the thus-gone Joy of Awakening |#| And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་ མེ་ཏོག་ རི་བོ་ གར་མཁན་ བུར །_། གྱུར་ ཚེ་ བདེ་གཤེགས་ དབང་པོ་ ཞི་ དེ་ ཡི །_། སྤྱན་སྔ ར་ བྲོ་གར་ དག་ གིས་ མཆོད་ནས་ ཀྱང་ །_། དང་པོ ར་ བྱང་ཆུབ་ ཏུ་ ནི་ སེམས་བསྐྱེད་ དོ །_།
en: $166 “The well-gone Kusumaparvata, when the son of a dancer, |#| Offered worship through dance |#| To the well-gone Serene Faculties |#| And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་ ཀླུ་ དགའ་ གར་མཁན་ བུར་ གྱུར་ ཚེ །_། དེ་བཞིན་ གཤེགས་པ་ ཉི་མ འི་ འོད་ དེ་ ལ །_། རོལ་མོ འི་ སྒྲ་ དག་ བསྒྲགས་པ་ བྱས་ ནས་ |#| ཀྱང་ །_། དང་པོ ར་ བྱང་ཆུབ་ ཏུ་ ནི་ སེམས་བསྐྱེད་ དོ །_།
en: $167 “The well-gone Nāganandin, when the son of a dancer, |#| Played melodious music |#| For the thus-gone Sunlight |#| And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་ སྤོས་ ཀྱི་ དབང་ཕྱུག་ རྒྱལ་པོ་ ཡི །_། སྲས་མོ ར་ གྱུར་ ཚེ་ དེ་བཞིན་ གཤེགས་པ་པོ །_། པད་དཀར་ སྤོས་ ལ་ མུ་ཏིག་ རྒྱན་ ཕྲེང་ ཕུལ །_། |#| དང་པོ ར་ བྱང་ཆུབ་ ཏུ་ ནི་ སེམས་བསྐྱེད་ དོ །_།
en: $168 “The well-gone Gandheśvara, when a princess, |#| Offered a pearl garland |#| To the thus-gone White Lotus Fragrance |#| And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་ ཤིན་ཏུ་ གྲགས་པ་ ཚོང་དཔོན་ གྱི །_། ཆུང་མ ར་ གྱུར་ ཚེ་ དེ་བཞིན་ གཤེགས་པ་པོ །_། ལྷུན་པོ འི་ འོད་ཟེར་ སྤྱི་བོ ར་ བླ་རེ་ ཕུལ །_། |#| དང་པོ ར་ བྱང་ཆུབ་ ཏུ་ ནི་ སེམས་བསྐྱེད་ དོ །_།
en: $169 “The well-gone Atiyaśas, when the wife of a merchant, |#| Offered a canopy to be placed over the head |#| To the thus-gone Radiant Mountain |#| And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་ སྟོབས་ ལྷ་ གྲོང་ཁྱེར་ རྟེན་པ འི་ ཚེ །_། དེ་བཞིན་ གཤེགས་པ་ ཟླ་བ འི་ ཞལ་ དེ་ ལ །_། བཤོས་ དྲོན་ ལྷུང་བཟེད་ བཀང་ སྟེ་ |#| ཕུལ་ ནས་ |#| ཀྱང་ །_། དང་པོ ར་ བྱང་ཆུབ་ ཏུ་ ནི་ སེམས་བསྐྱེད་ དོ །_།
en: $170 “The well-gone Baladeva, when a city beggar, |#| Offered an alms bowl filled with hot food |#| To the thus-gone Moon Face |#| And in doing so first gave rise to the mind of awakening.

source: དེ་བཞིན་ གཤེགས་པ་ ཡོན་ཏན་ ཕྲེང་ལྡན་ གྱིས །_། དེ་བཞིན་ གཤེགས་པ་ བསྒྱིངས་ ལྡན་ བཞུད་ དེ་ ལ །_། སངས་རྒྱས་ ཕྱག་ འཚལ་ ཐལ་མོ་ ལན་ གསུམ་ སྦྱར །_། |#| དང་པོ ར་ བྱང་ཆུབ་ ཏུ་ ནི་ སེམས་བསྐྱེད་ དོ །_།
en: $171 “The thus-gone Guṇamālin |#| Joined his palms three times in homage to the Buddha |#| Before the thus-gone Striding Departure |#| And in doing so first gave rise to the mind of awakening.

source: དེ་བཞིན་ གཤེགས་པ་ ཀླུ་ ལག་ གྲོང་ཁྱེར་ གྱི །_། སྒོ་ སྲུངས་ ཚེ་ ན་ ཕྱག་དར་ བྱས་ ནས་ |#| ཀྱང་ །_། དེ་བཞིན་ [296b] གཤེགས་པ་ ཕྱོགས་ རྣམས་ ལྟ་ དེ་ ལ །_། དང་པོ ར་ བྱང་ཆུབ་ ཏུ་ ནི་ སེམས་བསྐྱེད་ དོ །_།
en: $172 “The thus-gone Nāgabhuja, when a guardian of a city gate, |#| Swept the ground |#| Before the thus-gone Looking in All Directions [296.b] |#| And in doing so first gave rise to the mind of awakening.

source: དེ་བཞིན་ གཤེགས་པ་ མིག་ བརྒྱན་ རྒྱལ་བུ འི་ ཚེ །_། དེ་བཞིན་ གཤེགས་པ་ ཆོས་ ཀྱི་ འོད་ དེ་ ལ །_། ཆུ་ དང་ སྐྱུ་རུ་ར་ དག་ ཕུལ་ ནས་ |#| ཀྱང་ །_། དང་པོ ར་ བྱང་ཆུབ་ ཏུ་ ནི་ སེམས་བསྐྱེད་ དོ །_།
en: $173 “The thus-gone Pratimaṇḍita­locana, when a prince, |#| Offered water and myrobalan fruits |#| To the thus-gone Dharma Light |#| And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་ ཚུལ་ཁྲིམས་ གསལ་ དེ་ སྔ་དྲོ་ ཞིག _། དེ་བཞིན་ གཤེགས་པ་ ལེགས་པ ར་ སྦྱངས་པ འི་ བློས །_། དགའ་བ ས་ སངས་རྒྱས་ རྗེས་སུ་ དྲན་ བྱས་ ནས །_། |#| དང་པོ ར་ བྱང་ཆུབ་ ཏུ་ ནི་ སེམས་བསྐྱེད་ དོ །_།
en: $174 “The well-gone Sucīrṇabuddhi, early one morning, Joyfully recollected the buddha, The thus-gone Brilliant Discipline And in doing so first gave rise to the mind of awakening. |#| |#| |#|

source: དེ་བཞིན་ གཤེགས་པ་ ཟིལ་གནོན་ ཡེ་ཤེས་ ཀྱིས །_། ངན་འགྲོ ར་ འགྲོ་བ་ ཚུལ་ཁྲིམས་ ལ་ བཀོད་ ནས །_། |#| དེ་བཞིན་ གཤེགས་པ་ མཐའ་ ཡ ས་ བློ་ དེ་ ལ །_། དང་པོ ར་ བྱང་ཆུབ་ ཏུ་ ནི་ སེམས་བསྐྱེད་ དོ །_།
en: $175 “The thus-gone Jñānābhibhū |#| Established beings of the lower realms in discipline |#| And so, before the thus-gone Infinite Mind, |#| First gave rise to the mind of awakening.

source: བདེ་གཤེགས་ མཐའ་ ཡ ས་ སྤྱན་ ནི་ གོས་ འཚོང་ ཚེ །_། དེ་བཞིན་ གཤེགས་པ་ མཐའ་ ཡ ས་ གཟུགས་ དེ་ ལ །_། རས་ བཅོས་ བླ་རེ་ དག་ ནི་ ཕུལ་ ནས་ |#| ཀྱང་ །_། དང་པོ ར་ བྱང་ཆུབ་ ཏུ་ ནི་ སེམས་བསྐྱེད་ དོ །_།
en: $176 “The well-gone Amitalocana, when a clothing merchant, |#| Offered a canopy of fine fabric |#| To the thus-gone Infinite Form |#| And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་ བདེན་ གསུང་ ཁྱིམ་བདག་ བུར་ གྱུར་ ཚེ །_། དེ་བཞིན་ གཤེགས་པ་ བརྩོན་འགྲུས་ བརྟན་ དེ་ ལ །_། མེ་ཏོག་ དག་ ལས་ བྱས་པ འི་ གདུགས་ ཕུལ་ ནས །_། |#| དང་པོ ར་ བྱང་ཆུབ་ ཏུ་ ནི་ སེམས་བསྐྱེད་ དོ །_།
en: $177 “The well-gone Satyabhāṇin, when the son of a householder, |#| Offered a parasol made of flowers |#| To the thus-gone Steadfast Diligence |#| And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་ ཉི་འོད་ བཅའ་བ་ མཁན་ བུ འི་ ཚེ །_། དེ་བཞིན་ གཤེགས་པ་ ལྷ་ ཡིས་ མཆོད་ དེ་ |#| ལ །_། ལ་དུ་ དག་ ནི་ དབུལ་བ་ བྱས་ ནས་ |#| ཀྱང་ །_། དང་པོ ར་ བྱང་ཆུབ་ ཏུ་ ནི་ སེམས་བསྐྱེད་ དོ །_།
en: $178 “The well-gone Sūryaprabha, when the son of a cook, |#| Offered laḍḍu sweets |#| To the thus-gone Worshiped by Gods |#| And in doing so first gave rise to the mind of awakening.

source: དེ་བཞིན་ གཤེགས་པ་ དེས་ བློ་བཟོ་ མཁན་ ཚེ །_། དེ་བཞིན་ གཤེགས་པ་ ཀུན་ ནས་ བློ་ དེ་ ལ །_། གདིང་བ་ དག་ ནི་ དབུལ་བ་ བྱས་ ནས་ ཀྱང་ །_། དང་པོ ར་ བྱང་ཆུབ་ ཏུ་ ནི་ སེམས་བསྐྱེད་ དོ །_།
en: $179 “The thus-gone Niyatabuddhi, when an artisan, |#| Offered sitting mats |#| To the thus-gone Universal Mind |#| And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་ མཐའ་ ཡ ས་ གཟུགས་ ནི་ ཤིང་རྟ་ མཁན །_། གྱུར་ ཚེ་ དེ་བཞིན་ གཤེགས་པ་ འོད་ ཞི་ ལ །_། པ་ ལ་ ཤི་ ཀ་དག་ ནི་ ཕུལ་ ནས་ |#| ཀྱང་ །_། དང་པོ ར་ བྱང་ཆུབ་ ཏུ་ ནི་ སེམས་བསྐྱེད་ དོ །_།
en: $180 “The well-gone Anantarūpa, when a chariot maker, |#| Offered leaves |#| To the thus-gone Serene Light |#| And in doing so first gave rise to the mind of awakening.
